nickfox-taterli/stm32l4_qspi_benchmark/Core/Src/main.c
#include "stm32l4xx_hal.h"
#include "qspi.h"

#include <string.h>

QSPI_HandleTypeDef hqspi;

void SystemClock_Config(void);

uint8_t wData[0x400];
uint8_t rData[0x2000];

volatile uint32_t time_start, time_end, time_diff;

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  HAL_Init();

  SystemClock_Config();
  BSP_QSPI_Init();

  // 1KB 数据
  for(uint16_t i = 0;i < 0x400;i++){
    wData[i] = i;
    rData[i] = 0;
  }

  for(uint16_t i = 0;i < 16;i++){
    BSP_QSPI_Erase_Block(i);      
  }
  
  for(uint16_t i = 0;i < 16;i++){
    BSP_QSPI_Write(wData,0x400 * i,0x400);      
  }
  
  BSP_QSPI_MemoryMappedMode();
  
  HAL_Delay(5);
  
  time_start = HAL_GetTick();
  
  // 1GB 数据传输
  for(uint32_t i =0;i < (1024 * 1024) ;i++){
     memcpy(&rData,(void *)0x8000000,0x400);
  }
  
  time_end = HAL_GetTick();
  time_diff = time_end - time_start;
  
  while (time_diff)
  {
      
  }
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_MSI;
  RCC_OscInitStruct.MSIState = RCC_MSI_ON;
  RCC_OscInitStruct.MSICalibrationValue = 0;
  RCC_OscInitStruct.MSIClockRange = RCC_MSIRANGE_6;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_MSI;
  RCC_OscInitStruct.PLL.PLLM = 1;
  RCC_OscInitStruct.PLL.PLLN = 40;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = RCC_PLLQ_DIV2;
  RCC_OscInitStruct.PLL.PLLR = RCC_PLLR_DIV2;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    for(;;);
  }
  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_4) != HAL_OK)
  {
    for(;;);
  }
  /** Configure the main internal regulator output voltage
  */
  if (HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1) != HAL_OK)
  {
    for(;;);
  }
}
